notes/meeting_2022mar13.org
* meeting notes March 13, 2022
** the raku study group

** usual links to the meeting material
*** https://github.com/doomvox/raku-study/blob/main/notes/meetingmar13.md 
*** https://github.com/doomvox/raku-study/tree/main/bin/2022mar13

** raku script to append filename suffixes
*** https://github.com/doomvox/raku-study/tree/main/bin/2022mar13/tagger.taku
*** https://github.com/doomvox/raku-study/blob/main/talks/file_metadata

** dpchrist:
*** circular dependencies with Exporter-based perl modules
**** https://www.nntp.perl.org/group/perl.module-authors/2022/03/msg11231.html
**** An improvement:  require MyCode; MyCode->import;

** bruce gray
*** perl/raku conference in houston extends deadline to May-- need raku talks
*** weekly challenge (1) find missing permutation; (2) padovan primes

** rob ransbottom
*** github.com/0rir/touch/blob/master/lib/Touch.rakumod

** announcements 
*** March 27th: next raku study group meeting 
*** June 21-25: tprc: perl/raku conference 

