notes/meeting_2022mar13.md
- [meeting notes March 13, 2022](#org3ff5dee)
  - [the raku study group](#orgd884895)
  - [usual links to the meeting material](#org2e81a37)
    - [<https://github.com/doomvox/raku-study/blob/main/notes/meetingmar13.md>](#orgada420f)
    - [<https://github.com/doomvox/raku-study/tree/main/bin/2022mar13>](#org274235a)
  - [raku script to append filename suffixes](#org807893d)
    - [<https://github.com/doomvox/raku-study/tree/main/bin/2022mar13/tagger.taku>](#org81e70b4)
    - [<https://github.com/doomvox/raku-study/blob/main/talks/file_metadata>](#orgb42834d)
  - [dpchrist:](#org1265688)
    - [circular dependencies with Exporter-based perl modules](#org134b5ff)
  - [bruce gray](#orgd36a2c0)
    - [perl/raku conference in houston extends deadline to May&#x2013; need raku talks](#orgbd3ba87)
    - [weekly challenge (1) find missing permutation; (2) padovan primes](#orgf977013)
  - [rob ransbottom](#org1364c5f)
    - [github.com/0rir/touch/blob/master/lib/Touch.rakumod](#org15fc9b6)
  - [announcements](#org034c15b)
    - [March 27th: next raku study group meeting](#org4e7a117)
    - [June 21-25: tprc: perl/raku conference](#org9e2154b)


<a id="org3ff5dee"></a>

# meeting notes March 13, 2022


<a id="orgd884895"></a>

## the raku study group


<a id="org2e81a37"></a>

## usual links to the meeting material


<a id="orgada420f"></a>

### <https://github.com/doomvox/raku-study/blob/main/notes/meetingmar13.md>


<a id="org274235a"></a>

### <https://github.com/doomvox/raku-study/tree/main/bin/2022mar13>


<a id="org807893d"></a>

## raku script to append filename suffixes


<a id="org81e70b4"></a>

### <https://github.com/doomvox/raku-study/tree/main/bin/2022mar13/tagger.taku>


<a id="orgb42834d"></a>

### <https://github.com/doomvox/raku-study/blob/main/talks/file_metadata>


<a id="org1265688"></a>

## dpchrist:


<a id="org134b5ff"></a>

### circular dependencies with Exporter-based perl modules

1.  <https://www.nntp.perl.org/group/perl.module-authors/2022/03/msg11231.html>

2.  An improvement:  require MyCode; MyCode->import;


<a id="orgd36a2c0"></a>

## bruce gray


<a id="orgbd3ba87"></a>

### perl/raku conference in houston extends deadline to May&#x2013; need raku talks


<a id="orgf977013"></a>

### weekly challenge (1) find missing permutation; (2) padovan primes


<a id="org1364c5f"></a>

## rob ransbottom


<a id="org15fc9b6"></a>

### github.com/0rir/touch/blob/master/lib/Touch.rakumod


<a id="org034c15b"></a>

## announcements


<a id="org4e7a117"></a>

### March 27th: next raku study group meeting


<a id="org9e2154b"></a>

### June 21-25: tprc: perl/raku conference
